read_verilog -sv patternMealy.sv

hierarchy -check -top patternMealy 

proc; opt; flatten; techmap; opt

abc -g AND,OR,XOR

write_json patternMealy.json
